app/controllers/perriors_controller.rb

  def index
    @perriors = Perrior.all
---
SELECT "perriors".* FROM "perriors"

  def create
    @perrior = Perrior.new(perrior_params)

    respond_to do |format|
      if @perrior.save
---
INSERT INTO "perriors" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "i like that"], ["content", "thats amazing"], ["created_at", "2021-10-01 14:11:33.943714"], ["updated_at", "2021-10-01 14:11:33.943714"]]

    def set_perrior
      @perrior = Perrior.find(params[:id])
---
SELECT "perriors".* FROM "perriors" WHERE "perriors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]